#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bervproject/app-runner/runs/run-5Js1w5pKymF2vbt3

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apprunner_service.docker_ip will be created
  + resource "aws_apprunner_service" "docker_ip" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "docker-ip"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags_all                       = (known after apply)

      + source_configuration {
          + auto_deployments_enabled = false

          + image_repository {
              + image_identifier      = "public.ecr.aws/nginx/nginx:1.24-alpine-slim"
              + image_repository_type = "ECR_PUBLIC"

              + image_configuration {
                  + port = "80"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @berviantoleo, Action: `pull_request`*